# RebarContainerIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerIterator Class
Members See Also
---
An iterator to a Rebar Container.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class RebarContainerIterator : IEnumerator<RebarContainerItem>
```

Visual Basic
---
```text
Public Class RebarContainerIterator _
	Implements IEnumerator(Of RebarContainerItem)
```

Visual C++
---
```text
public ref class RebarContainerIterator : IEnumerator<RebarContainerItem^>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarContainerIterator
# See Also
RebarContainerIterator Members
Autodesk.Revit.DB.Structure Namespace